{
  "summary": [
    {
      "component": "Buyer's current solution",
      "arrStrings": "- Tuf outsources payroll to Payroll Options, a traditional bureau\n- Tuf prepares payroll on the Tuesday before the last Friday of the month\n- Tuf sends payroll to Payroll Options on the Wednesday\n- Payroll Options takes a few days to process payroll\n- Tuf checks payroll for accuracy and initiates payment on the last Friday of the month\n- BACS takes two days to process payment\n- Tuf has to follow up with employees and HR to ensure all information is correct - Tuf is using Hibob for his customer's payroll needs.\n- Tuf has been using Hibob for two months and is still getting used to the system.\n- Tuf spends two full days on payroll every week.\n- Tuf uses a journal to manipulate the gross and net wages and push them into the accounting software.\n- Tuf spends 10-15 minutes on the journal."
    },
    {
      "component": "Buyer's pain points with current solution",
      "arrStrings": "-The process is very long for Tuf\n-Tuf has to liaise with internal employees and HR to make sure all information is correct\n-Tuf has to check the information provided by the payroll company to make sure it is correct\n-The payroll company does not always provide accurate or timely information\n-The payroll company is not always responsive to Tuf's inquiries\n-Tuf has to initiate the payroll process on the 21st of the month in order to get paid on the 30th - Tuf has to tell payroll company every time they want to exceed the BACS limit\n- If the BACS limit is exceeded, the employees may not get paid on time\n- Tuf has to spend two to three hours making changes every week\n- Tuf has to spend another half an hour to an hour going through the reports\n- Tuf has to manually create a journal and pull in figures based on the report\n- Tuf spends 10 to 15 minutes creating a journal for the departments - Tuf has to constantly check payroll information, and so does HR\n- This is a long and tedious process\n- There is a lot of room for error\n- Tuf would like a platform that automates the process and requires only one check - Tuf and Ivy currently share a spreadsheet to track changes in HiBob. This is inefficient and time-consuming.\n- There is no audit trail within the payroll section to track changes.\n- Tuf would like an approval process from HR in order to approve bonuses. - Tuf's current payroll solution is not able to handle the growth of his company\n- Tuf's current payroll solution is not able to handle the complexity of his company's payroll\n- Tuf's current payroll solution is not able to provide the level of support that he needs\n- Tuf's current payroll solution is not transparent in terms of pricing"
    },
    {
      "component": "Benefits of seller's solution",
      "arrStrings": "- Pento eliminates the need for multiple checks by both Tuf and HR\n- Pento integrates with NEST to keep pension contributions up to date\n- Pento pushes payroll information into Hibob in real time\n- Pento generates a reconciled journal ready for Xero\n- Pento sends out a payroll report automatically\n- Pento enrolls employees in payroll automatically -The Pento tool offers real time support to admins with a response rate of 25 minutes\n-Pento integrates with Hibob, allowing for One source of truth for employees \n-Pento offers controllables and variables to be controlled by the user, giving flexibility\n-Pento eliminates the need for cut-offs dictated by outsourcing\n-Pento allows for faster payments to employees -The main benefit of the Pento solution is that it is much easier and more intuitive to use than the current Genflow system.\n-Pento will also save time by automatically tracking and updating tax information for employees, and by eliminating the need for manual reconciliation of payroll data.\n-Other benefits include the ability to easily add new employees and salary types, and to view real-time analytics on the payroll. - Pento's solution includes a bulk application that makes it easy to upload employee data from a CSV file.\n- Pento's solution allows for easy creation of custom pay items, and includes a flexible setup that can be tailored to the needs of the business.\n- Pento's solution includes an audit log that tracks any changes made to employee data. This makes it easy to track who made a change and when.\n- Pento's solution is easy to use and can be accessed by anyone in the company, including HR and payroll professionals.\n- Pento's solution is reliable and can save the company time and money."
    },
    { "component": "Buyer's decision makers", "arrStrings": "" },
    { "component": "Buyer's reasons to not buy", "arrStrings": "" },
    { "component": "Buyer's decision making process", "arrStrings": "" },
    {
      "component": "Agreed next steps",
      "arrStrings": "-Eve will provide Tuf with a template that Tuf can use to onboard new employees\n-Eve will investigate whether or not the Pento employee log will show who added a bonus and will get back to Tuf\n-Tuf will share his screen with Ivy and confirm all changes before sending them over to the payroll department - Tuf will speak to his CFO tomorrow, and they will have a 15 minute catch up on Friday morning to discuss further.\n- Eve will update Tuf with all of the integration information and then send out the call.\n- Tuf and Eve will discuss payroll options and notice, and then decide on a timeline for when Pento will go live."
    }
  ]
}
